//#include <stdio.h>
//#include <stdlib.h>
//
//int  main(void)
//{
//    int  i=1; //  循环控制变量
//	int  j=2;
//	/*for(i=1,j=5;i<=5;i++)
//	{
//	printf("%d,%d\n",i,j);
//	j--;
//	}*/
//	//for (printf("执行语句1\n");i<=5;i++) 
//	//	//  第一个条件对应的是变量初始化的语句，只要是合法的语句都是可以的，可以调用函数等的。尽量的不要重新书写的。
//	//{
//	//	printf("%d\n",i);
//	//}
//	// 循环控制条件什么都不写的话，对应的是一个死循环的。需要注意的。
//	//for (printf("执行语句1\n");printf("循环控制条件对应的是一个变量的，死循环的\n");i++) 
//	//	//  第一个条件对应的是变量初始化的语句，只要是合法的语句都是可以的，可以调用函数等的。尽量的不要重新书写的。
//	//{
//	//	printf("%d\n",i);
//	//}
//	//   对于for循环的条件，不要书写其他的意义的。主要的目标是实现循环变量的控制的。
//	//for(i=1,j=5;i<=5;i++,j--) //  多个变量语句的，可以书写多个条件的变化的。
//	//{
//	//   printf("%d,%d\n",i,j);
//	//}
//	//system("pause");
//	for(;;)  //  对应的是死循环的，和while(1)的本质区别是一样的。
//	return  0;
//}