//#include <stdio.h>
//#include <stdlib.h>
//#include <memory.h>
//
//int main(void)
//{
////	 int (*p)[5]=(int(*)[5])malloc(sizeof(int)*5);  // 定义一维数组指针,对应的是存储的是指针的空间的
////	 //int  a[5]; //  对应的需要将相关的指针的位置对应的存储到数组中的
////	 //int (*p1)[5]=&a; // 
////	 int i=0;
////	 *((*p+0))=0;  // *(p+0) 对应的是地址信息的
////	 *((*p+1))=1;
////	 *((*p+2))=2;
////	 *((*p+3))=3;
////	 *((*p+4))=4;
////	 for (i=0;i<5;i++)
////	 {
////	 printf("%d\n",*(*p+i));
////	 }
////	 free(p);
//
////  二位数组的处理
//    int (*p)[2][3]=(int(*)[2][3])malloc(sizeof(int)*2*3);  //  对应的没有赋值任何的操作的。对应的有什么意义了？
//    int  a[2][3];
//	int (*p1)[2][3]=&a;  //  *p1==a
//	int i=0;
//	int j=0;
//	(*p1)[0][0]=0;
//	(*p1)[0][1]=1;
//	(*p1)[0][2]=2;
//	(*p1)[1][0]=3;
//	(*p1)[1][1]=4;
//	(*p1)[1][2]=5;
//	for (i=0;i<2;i++)
//	{
//		for(j=0;j<3;j++)
//		{
//	       printf("%d\n",(*p1)[i][j]);
//		}
//	 }
//	free(p);
//	system("pause");
//	return 0;
//}