//#include <stdio.h>
//#include <stdlib.h>
//
//
//int  main(void)
//{
//	//{{2,3},{4,5},{7,8}}
//	int  a[3][2]={{2,3},{4,5},{7,8}};  //  二维数组的初始化
//	//printf("%d\n",sizeof(a));  //  6*4=24
//	//  二维数组的初始化
//	//  完全的初始化
//	int a1[3][2]={
//		{2,3},
//		{4,5},
//		{7,8}
//	};
//	//  对应的是部分初始化
//	int a2[3][2]={
//		{1,2},
//		{3,4}
//	};
//	int a3[3][2]={
//		{1},
//		{3,4}
//	};
//	int a4[3][2]={1,2,3,4,5};
//	int a5[][2]={{2,3},{4,5}};
//	int a6[][2]={2,3,4};
//	system("pause");
//	return 0;
//}