//#include <stdio.h>
//#include <stdlib.h>
////  测试二维数组的地址
//int main(void)
//{
//	int a[3][2]={1,2,3,4,5,6};
//	printf("%d,%d,%d,%d,%d,%d\n",&a[0][0],&a[0][1],&a[1][0],&a[1][1],&a[2][0],&a[2][1]); //  对应的内存地址
//	//  对应的获取地址元素
//	printf("%d,%d\n",&a[0][0],&a[0][0]+1); 
//	printf("%d,%d,%d,%d,%d,%d\n",&a[0],&a[1],&a[2]);   //  对应的内存地址
//	//  对应的获取地址元素
//	printf("%d,%d\n",&a[0],&a[0]+1);
//	printf("%d\n",&a);
//	printf("%d\n",&a+1);
//	printf("%d\n",a==&a[0]);  //  对应的是一模一样的，不存在任何问题的。
//	printf("%d\n",a==&a[0][0]);  //  数据是一样的，但是级别是不一样的，存在问题的。
//	system("pause");
//	return  0;
//}