//#include <stdio.h>
//#include <stdlib.h>
//int main(void)
//{
//	char  str[5]={'a','b','c','d','e'};     //对应的是纯字符数组
//	char  str1[5]={'a','b','c','d','\0'};  //对应的是字符串
//	char  str2[5]={'a','b','c','d',0};    //对应的是字符串
//	char  str3[5]={'a','b','c','\0'};    //对应的是字符串
//	char  str4[5]={'a','b','c'}; //对应的是字符字符串，初始化部分元素，后面没有初始化的元素对应的是0
//	//对应的字符串的输出
//	//printf("%s\n",str1); // 对应的是字符串的输出操作的
//	//printf("%s\n",str2);
//	//printf("%s\n",str3);
//	//printf("%s\n",str4);
//	//字符串的打印,遇到\0的时候对应的就不会继续打印内容了。
//	char str5[6]={'a','b',0,'c','d'};
//	char str6[6]={'1','2','3','4','5','6'};
//	//printf("%s\n",str5);  //  输出结果ab
//	//printf("%s\n",str6);  //  输出结果异常 123456烫烫烫烫烫ab  对应的是一个字符数组的。使用%s打印的话出现异常。
//	//printf("%s\n",str5[0]);  // 从给定的地址开始打印的。遇到\0对应的结束输出。
//	puts(&str5[0]);  //  可以实现类似于printf的相关的功能的。
//	system("pause");
//	return 0;
//}