//#include <stdio.h>
//#include <stdlib.h>
//int main(void)
//{
//	int a[2][3]={{1,2,3},{4,5,6}};
//	//int (*p)[2][3]=&a;
//	//int  *p=&a[0][0];
//	//  &a[0]=&a[0][0];
//	//printf("%d,%d,%d,%d,%d,%d\n",*p,*(p+1),*(p+2),*(p+3),*(p+4),*(p+5));//  证明了数组是连续的空间的，不管是一维数组还是二维数组
//    //printf("%p,%p,%p,%p,%p,%p\n",p,p+1,p+2,p+3,p+4,p+5); //  数组的连续空间的
//	//  *(p+n)=p[n] p代表的是首地址
//	//printf("%d\n",p[2]); // 3
//	int (*p)[3]=&a[0]; //  通过p遍历所有的元素的  *p=a[0]
//	// *(p+1)==a[1]==p[1];
//	printf("%d,%d\n",*(p+1)==a[1],*(p+1)==p[1]); //  对应的答案还1 1 
//	system("pause");
//	return  0;
//}