//#include <stdio.h>
//#include <stdlib.h>
//
//int main(void)
//{
//	int i=0;
//	int a=134480385;  //  判断是高位存储还是地位存储
//	char *p=(char*)&a;
//	//  采用指针的方式对应的采用地址的，还可以转换为大端存储的。
//	printf("%p,%p,%p,%p\n",p,p+1,p+2,p+3); // 005AF810,005AF811,005AF812,005AF813
//	printf("%d,%d,%d,%d\n",*(p+0),*(p+1),*(p+2),*(p+3));  //  1 2 4  8 
//	//  体现的是高位数据对应的是高地址的，对应的是小端存储的
//	//  下面可以将小端存储转化为大端存储的操作的。将p0和p3进行交换的。
//	for(i=0;i<sizeof(a);i++)
//	{
//		//  下面对应的只是数值转换的
//		char  temp=*(p+i);
//		*(p+i)=*(p+sizeof(a)-1-i);
//		*(p+sizeof(a)-1-i)=temp;
//	}
//	// 转换之后的数据存储的。改变不了内存中的存储的。
//	printf("%p,%p,%p,%p\n",p,p+1,p+2,p+3); // 005AF810,005AF811,005AF812,005AF813
//	printf("%d,%d,%d,%d\n",*(p+0),*(p+1),*(p+2),*(p+3));  //  1 2 4  8
//	system("pause");
//	return 0;
//}